In [176]:
pip install seaborn

Requirement already satisfied: seaborn in /usr/local/lib/python3.7/dist-packages (0.11.1)
Requirement already satisfied: pandas>=0.23 in /usr/local/lib/python3.7/dist-packages (from seaborn) (1.1.5)
Requirement already satisfied: matplotlib>=2.2 in /usr/local/lib/python3.7/dist-packages (from seaborn) (3.2.2)
Requirement already satisfied: scipy>=1.0 in /usr/local/lib/python3.7/dist-packages (from seaborn) (1.4.1)
Requirement already satisfied: numpy>=1.15 in /usr/local/lib/python3.7/dist-packages (from seaborn) (1.19.5)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas>=0.23->seaborn) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas>=0.23->seaborn) (2018.9)
Requirement already satisfied: kiwisolver>=1.0.1 in /usr/local/lib/python3.7/dist-packages (from matplotlib>=2.2->seaborn) (1.3.1)
Requirement already satisfied: cycler>=0.10 in /usr/local/lib/python3.7/dist-packages (from matplotlib>=2.2->seaborn) (0.10.0)
Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.1 in /usr/local/lib/python3.7/dist-packages (from matplotlib>=2.2->seaborn) (2.4.7)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas>=0.23->seaborn) (1.15.0)

In [177]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [178]:
from google.colab import files
uploaded = files.upload()
df = pd.read_csv('results.csv')

Saving results.csv to results (1).csv

In [179]:
df = pd.read_csv('results.csv')

In [180]:
result=np.concatenate(  (df.home_team,df.away_team),axis=0  )

In [181]:
result.size

83752

In [182]:
result=np.unique(result)

In [183]:
result.size

313

In [184]:
df = pd.read_csv('results.csv')

In [185]:
df.dtypes

date          object
home_team     object
away_team     object
home_score     int64
away_score     int64
tournament    object
city          object
country       object
neutral         bool
dtype: object

In [186]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41876 entries, 0 to 41875
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        41876 non-null  object
 1   home_team   41876 non-null  object
 2   away_team   41876 non-null  object
 3   home_score  41876 non-null  int64
 4   away_score  41876 non-null  int64
 5   tournament  41876 non-null  object
 6   city        41876 non-null  object
 7   country     41876 non-null  object
 8   neutral     41876 non-null  bool
dtypes: bool(1), int64(2), object(6)
memory usage: 2.6+ MB

In [187]:
df.describe()

         home_score    away_score
count  41876.000000  41876.000000
mean       1.744293      1.186503
std        1.752248      1.403053
min        0.000000      0.000000
25%        1.000000      0.000000
50%        1.000000      1.000000
75%        2.000000      2.000000
max       31.000000     21.000000

In [188]:
df.head(50)

          date         home_team  ...              country  neutral
0   1872-11-30          Scotland  ...             Scotland    False
1   1873-03-08           England  ...              England    False
2   1874-03-07          Scotland  ...             Scotland    False
3   1875-03-06           England  ...              England    False
4   1876-03-04          Scotland  ...             Scotland    False
5   1876-03-25          Scotland  ...             Scotland    False
6   1877-03-03           England  ...              England    False
7   1877-03-05             Wales  ...                Wales    False
8   1878-03-02          Scotland  ...             Scotland    False
9   1878-03-23          Scotland  ...             Scotland    False
10  1879-01-18           England  ...              England    False
11  1879-04-05           England  ...              England    False
12  1879-04-07             Wales  ...                Wales    False
13  1880-03-13          Scotland  ...             Scotland    False
14  1880-03-15             Wales  ...                Wales    False
15  1880-03-27          Scotland  ...             Scotland    False
16  1881-02-26           England  ...              England    False
17  1881-03-12           England  ...              England    False
18  1881-03-14             Wales  ...                Wales    False
19  1882-02-18  Northern Ireland  ...  Republic of Ireland    False
20  1882-02-25             Wales  ...                Wales    False
21  1882-03-11          Scotland  ...             Scotland    False
22  1882-03-13             Wales  ...                Wales    False
23  1882-03-25          Scotland  ...             Scotland    False
24  1883-02-03           England  ...              England    False
25  1883-02-24           England  ...              England    False
26  1883-03-10           England  ...              England    False
27  1883-03-12             Wales  ...                Wales    False
28  1883-03-17  Northern Ireland  ...  Republic of Ireland    False
29  1884-01-26  Northern Ireland  ...  Republic of Ireland    False
30  1884-02-09             Wales  ...                Wales    False
31  1884-02-23  Northern Ireland  ...  Republic of Ireland    False
32  1884-03-15          Scotland  ...             Scotland    False
33  1884-03-17             Wales  ...                Wales    False
34  1884-03-29          Scotland  ...             Scotland    False
35  1885-02-28           England  ...              England    False
36  1885-03-14           England  ...              England    False
37  1885-03-14          Scotland  ...             Scotland    False
38  1885-03-21           England  ...              England    False
39  1885-03-23             Wales  ...                Wales    False
40  1885-04-11  Northern Ireland  ...  Republic of Ireland    False
41  1885-11-28     United States  ...        United States    False
42  1886-02-27             Wales  ...                Wales    False
43  1886-03-13  Northern Ireland  ...  Republic of Ireland    False
44  1886-03-20  Northern Ireland  ...  Republic of Ireland    False
45  1886-03-27          Scotland  ...             Scotland    False
46  1886-03-29             Wales  ...                Wales    False
47  1886-04-10          Scotland  ...             Scotland    False
48  1886-11-25     United States  ...        United States    False
49  1887-02-05           England  ...              England    False

[50 rows x 9 columns]

In [189]:
#df['Score'] = 0

In [190]:
df2 = df.drop_duplicates(subset=['home_team'])

In [191]:
df2= df2[['home_team']]

In [192]:
df2.head()

           home_team
0           Scotland
1            England
7              Wales
19  Northern Ireland
41     United States

In [193]:
df2=df2.reset_index()

In [194]:
df2.head()

   index         home_team
0      0          Scotland
1      1           England
2      7             Wales
3     19  Northern Ireland
4     41     United States

In [195]:

df2=df2.drop('index',axis=1)

In [196]:
df2.head()

          home_team
0          Scotland
1           England
2             Wales
3  Northern Ireland
4     United States

In [197]:
df2.loc[len(df2.index)] = ['Asturias'] 
df2.loc[len(df2.index)] = ['Western Australia'] 
df2.loc[len(df2.index)] = ['Two Sicilies'] 

df2.loc[len(df2.index)] = ['Congo DR'] 
df2.loc[len(df2.index)] = ['Surrey']

In [198]:
df2=df2.rename(columns={"home_team":"team" })

In [199]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 313 entries, 0 to 312
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   team    313 non-null    object
dtypes: object(1)
memory usage: 4.9+ KB

In [200]:
df2.index=df2.team

In [201]:
df2.head()

                              team
team
Scotland                  Scotland
England                    England
Wales                        Wales
Northern Ireland  Northern Ireland
United States        United States

In [202]:
df2['score'] = 0

In [203]:
df2.head()

                              team  score
team
Scotland                  Scotland      0
England                    England      0
Wales                        Wales      0
Northern Ireland  Northern Ireland      0
United States        United States      0

In [204]:
for w in df.index:

  if df.home_score[w] > df.away_score[w] :
    x=df.home_team[w]
    df2.loc[x,'score'] =  df2.score[x] + 3
  elif df.home_score[w] < df.away_score[w] :
    y=df.away_team[w]
    df2.loc[y,'score'] =  df2.score[y] + 3
  elif df.home_score[w] == df.away_score[w]:
    s=df.away_team[w]
    z=df.home_team[w]
    df2.loc[s,'score'] =  df2.score[s] + 1
    df2.loc[z,'score'] =  df2.score[z] + 1
    #else if df.home_score[w] < df.away_score[w] :
  #  z=df.home_team[w]
    #w=
   # df2.loc[y,'score'] =  df.home_score[w]
     #rowIndex = df.index[w]
     #df.loc[rowIndex, 'score'] = df.home_score[w]

In [205]:
df2.head()

                              team  score
team
Scotland                  Scotland   1289
England                    England   1974
Wales                        Wales    782
Northern Ireland  Northern Ireland    644
United States        United States   1033

In [206]:
df5=df2.sort_values(by=['score'],ascending=False)

In [207]:
df5.head(50)

                                    team  score
team
Brazil                            Brazil   2086
England                          England   1974
Germany                          Germany   1872
Argentina                      Argentina   1831
Sweden                            Sweden   1734
South Korea                  South Korea   1587
Mexico                            Mexico   1527
Hungary                          Hungary   1522
Italy                              Italy   1511
France                            France   1448
Spain                              Spain   1389
Netherlands                  Netherlands   1386
Uruguay                          Uruguay   1368
Scotland                        Scotland   1289
Poland                            Poland   1272
Russia                            Russia   1259
Denmark                          Denmark   1255
Belgium                          Belgium   1182
Zambia                            Zambia   1180
Austria                          Austria   1172
Romania                          Romania   1105
Egypt                              Egypt   1087
Norway                            Norway   1073
Japan                              Japan   1055
Portugal                        Portugal   1049
Saudi Arabia                Saudi Arabia   1038
Chile                              Chile   1034
United States              United States   1033
Ghana                              Ghana   1020
Switzerland                  Switzerland   1019
Trinidad and Tobago  Trinidad and Tobago   1008
China PR                        China PR    996
Ivory Coast                  Ivory Coast    987
Nigeria                          Nigeria    968
Uganda                            Uganda    966
Paraguay                        Paraguay    959
Iran                                Iran    950
Costa Rica                    Costa Rica    925
Bulgaria                        Bulgaria    922
Iraq                                Iraq    915
Morocco                          Morocco    903
Tunisia                          Tunisia    901
Kenya                              Kenya    892
Australia                      Australia    883
Kuwait                            Kuwait    865
Cameroon                        Cameroon    864
Thailand                        Thailand    859
Senegal                          Senegal    841
Republic of Ireland  Republic of Ireland    824
Turkey                            Turkey    805

In [208]:
df = pd.read_csv('results.csv')

In [209]:
df.head()

         date home_team away_team  ...     city   country neutral
0  1872-11-30  Scotland   England  ...  Glasgow  Scotland   False
1  1873-03-08   England  Scotland  ...   London   England   False
2  1874-03-07  Scotland   England  ...  Glasgow  Scotland   False
3  1875-03-06   England  Scotland  ...   London   England   False
4  1876-03-04  Scotland   England  ...  Glasgow  Scotland   False

[5 rows x 9 columns]

In [210]:
df['tournament'].value_counts()

Friendly                                17136
FIFA World Cup qualification             7257
UEFA Euro qualification                  2582
African Cup of Nations qualification     1672
FIFA World Cup                            900
                                        ...
World Unity Cup                             4
Dragon Cup                                  4
AFF Championship qualification              2
Copa Amrica qualification                  2
Atlantic Heritage Cup                       2
Name: tournament, Length: 112, dtype: int64

In [211]:
df3=df
df3=df[(df['tournament'] == "FIFA World Cup")]

In [212]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 900 entries, 1314 to 39960
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        900 non-null    object
 1   home_team   900 non-null    object
 2   away_team   900 non-null    object
 3   home_score  900 non-null    int64
 4   away_score  900 non-null    int64
 5   tournament  900 non-null    object
 6   city        900 non-null    object
 7   country     900 non-null    object
 8   neutral     900 non-null    bool
dtypes: bool(1), int64(2), object(6)
memory usage: 64.2+ KB

In [213]:
Golden_Age=df[(df['date'] < "1916-01-01")]
continental_era=df[(df['date'] > '1916-01-02') & (df['date'] < '1930-02-01')]
Interwar_Football_Europe=df[(df['date'] > '1930-01-02') & (df['date'] < '1937-02-01')]
Post_WWII_soccer_era=df[(df['date'] > '1937-01-02')]



```
#Golden_Age
```

In [214]:
df2.score = 0

In [215]:
df2.score = 0
for w in Golden_Age.index:

  if Golden_Age.home_score[w] > Golden_Age.away_score[w] :
    x=Golden_Age.home_team[w]
    df2.loc[x,'score'] =  df2.score[x] + 3
  elif Golden_Age.home_score[w] < Golden_Age.away_score[w] :
    y=Golden_Age.away_team[w]
    df2.loc[y,'score'] =  df2.score[y] + 3
  elif Golden_Age.home_score[w] == Golden_Age.away_score[w]:
    s=Golden_Age.away_team[w]
    z=Golden_Age.home_team[w]
    df2.loc[s,'score'] =  df2.score[s] + 1
    df2.loc[z,'score'] =  df2.score[z] + 1
df2.sort_values(by=['score'],ascending=False)

                        team  score
team
England              England    249
Scotland            Scotland    239
Hungary              Hungary     95
Wales                  Wales     85
Argentina          Argentina     70
...                      ...    ...
Vanuatu              Vanuatu      0
German DR          German DR      0
Guinea-Bissau  Guinea-Bissau      0
Indonesia          Indonesia      0
Surrey                Surrey      0

[313 rows x 2 columns]

In [216]:
df2.score = 0
for w in continental_era.index:

  if continental_era.home_score[w] > continental_era.away_score[w] :
    x=continental_era.home_team[w]
    df2.loc[x,'score'] =  df2.score[x] + 3
  elif continental_era.home_score[w] < continental_era.away_score[w] :
    y=continental_era.away_team[w]
    df2.loc[y,'score'] =  df2.score[y] + 3
  elif continental_era.home_score[w] == continental_era.away_score[w]:
    s=continental_era.away_team[w]
    z=continental_era.home_team[w]
    df2.loc[s,'score'] =  df2.score[s] + 1
    df2.loc[z,'score'] =  df2.score[z] + 1
df2.sort_values(by=['score'],ascending=False)

                team  score
team
Argentina  Argentina    184
Sweden        Sweden    162
Austria      Austria    149
Uruguay      Uruguay    147
Hungary      Hungary    130
...              ...    ...
Guinea        Guinea      0
Algeria      Algeria      0
Kuwait        Kuwait      0
Jordan        Jordan      0
Surrey        Surrey      0

[313 rows x 2 columns]

In [217]:
df2.score = 0
for w in Interwar_Football_Europe.index:

  if Interwar_Football_Europe.home_score[w] > Interwar_Football_Europe.away_score[w] :
    x=Interwar_Football_Europe.home_team[w]
    df2.loc[x,'score'] =  df2.score[x] + 3
  elif Interwar_Football_Europe.home_score[w] < Interwar_Football_Europe.away_score[w] :
    y=Interwar_Football_Europe.away_team[w]
    df2.loc[y,'score'] =  df2.score[y] + 3
  elif Interwar_Football_Europe.home_score[w] == Interwar_Football_Europe.away_score[w]:
    s=Interwar_Football_Europe.away_team[w]
    z=Interwar_Football_Europe.home_team[w]
    df2.loc[s,'score'] =  df2.score[s] + 1
    df2.loc[z,'score'] =  df2.score[z] + 1
df2.sort_values(by=['score'],ascending=False)

                    team  score
team
Germany          Germany    110
Austria          Austria    101
Sweden            Sweden    100
Italy              Italy     97
Hungary          Hungary     89
...                  ...    ...
Saint Lucia  Saint Lucia      0
Grenada          Grenada      0
Thailand        Thailand      0
Senegal          Senegal      0
Surrey            Surrey      0

[313 rows x 2 columns]

In [218]:
df4.head()

             date home_team    away_team  ...            city  country neutral
36099  2014-06-12    Brazil      Croatia  ...       So Paulo   Brazil   False
36100  2014-06-13     Chile    Australia  ...          Cuiab   Brazil    True
36101  2014-06-13    Mexico     Cameroon  ...           Natal   Brazil    True
36102  2014-06-13     Spain  Netherlands  ...        Salvador   Brazil    True
36103  2014-06-14  Colombia       Greece  ...  Belo Horizonte   Brazil    True

[5 rows x 9 columns]

In [219]:

df2.score = 0
for w in Post_WWII_soccer_era.index:

  if Post_WWII_soccer_era.home_score[w] > Post_WWII_soccer_era.away_score[w] :
    x=Post_WWII_soccer_era.home_team[w]
    df2.loc[x,'score'] =  df2.score[x] + 3
  elif Post_WWII_soccer_era.home_score[w] < Post_WWII_soccer_era.away_score[w] :
    y=Post_WWII_soccer_era.away_team[w]
    df2.loc[y,'score'] =  df2.score[y] + 3
  elif Post_WWII_soccer_era.home_score[w] == Post_WWII_soccer_era.away_score[w]:
    s=Post_WWII_soccer_era.away_team[w]
    z=Post_WWII_soccer_era.home_team[w]
    df2.loc[s,'score'] =  df2.score[s] + 1
    df2.loc[z,'score'] =  df2.score[z] + 1
df2.sort_values(by=['score'],ascending=False)

                        team  score
team
Brazil                Brazil   2008
Germany              Germany   1678
South Korea      South Korea   1587
England              England   1563
Argentina          Argentina   1524
...                      ...    ...
Asturias            Asturias      0
Palau                  Palau      0
Central Spain  Central Spain      0
Darfur                Darfur      0
Sark                    Sark      0

[313 rows x 2 columns]

5

In [220]:
df = pd.read_csv('results.csv')
df['date'] = pd.to_datetime(df['date'])
df2['host'] = 0
df2.score = 0

In [221]:
for w in df.index:

  if df.country[w] != df.home_team[w] and df.country[w] != df.away_team[w] :
    z=df.home_team[w]
    df2.loc[z,'host'] =  df2.host[z] + 1

In [222]:
df2.sort_values(by=['host'],ascending=False)

                    team  score  host
team
Mexico            Mexico      0   248
Brazil            Brazil      0   233
Argentina      Argentina      0   215
Iraq                Iraq      0   186
South Korea  South Korea      0   167
...                  ...    ...   ...
Crimea            Crimea      0     0
Myanmar          Myanmar      0     0
Yemen DPR      Yemen DPR      0     0
Saarland        Saarland      0     0
Surrey            Surrey      0     0

[313 rows x 3 columns]

#6

In [223]:
df.head()

        date home_team away_team  ...     city   country neutral
0 1872-11-30  Scotland   England  ...  Glasgow  Scotland   False
1 1873-03-08   England  Scotland  ...   London   England   False
2 1874-03-07  Scotland   England  ...  Glasgow  Scotland   False
3 1875-03-06   England  Scotland  ...   London   England   False
4 1876-03-04  Scotland   England  ...  Glasgow  Scotland   False

[5 rows x 9 columns]

In [224]:
df_fri=df[(df['tournament'] == "Friendly")]

In [225]:
df2['score'] = 0

In [226]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 313 entries, Scotland to Surrey
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   team    313 non-null    object
 1   score   313 non-null    int64
 2   host    313 non-null    int64
dtypes: int64(2), object(1)
memory usage: 19.8+ KB

In [227]:
df2.head()

                              team  score  host
team
Scotland                  Scotland      0    15
England                    England      0    52
Wales                        Wales      0    13
Northern Ireland  Northern Ireland      0    65
United States        United States      0    27

In [228]:
for w in df_fri.index:

    s=df_fri.away_team[w]
    z=df_fri.home_team[w]
    df2.loc[s,'score'] =  df2.score[s] + 1
    df2.loc[z,'score'] =  df2.score[z] + 1
df2.sort_values(by=['score'],ascending=False)

                        team  score  host
team
Germany              Germany    572    91
Hungary              Hungary    563    33
Sweden                Sweden    543    38
Poland                Poland    528    31
France                France    488    52
...                      ...    ...   ...
Alderney            Alderney      0     7
Sark                    Sark      0     1
land Islands  land Islands      0    27
South Ossetia  South Ossetia      0     7
Bonaire              Bonaire      0     8

[313 rows x 3 columns]

In [229]:
df_germany_fri=df_fri[(df_fri['home_team'] == 'Germany') | (df_fri['away_team'] == 'Germany')]

In [230]:
dfnofri=df_fri=df[(df['tournament'] != "Friendly")]

In [231]:
df_germany_no_fri=dfnofri[(df_fri['home_team'] == 'Germany') | (dfnofri['away_team'] == 'Germany')]

In [232]:
df_germany=df[(df['home_team'] == 'Germany') | (df['away_team'] == 'Germany')]

In [233]:
df_germany['winorlose']=0

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [235]:
df_germany.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 958 entries, 213 to 41839
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        958 non-null    datetime64[ns]
 1   home_team   958 non-null    object
 2   away_team   958 non-null    object
 3   home_score  958 non-null    int64
 4   away_score  958 non-null    int64
 5   tournament  958 non-null    object
 6   city        958 non-null    object
 7   country     958 non-null    object
 8   neutral     958 non-null    bool
 9   winorlose   958 non-null    int64
dtypes: bool(1), datetime64[ns](1), int64(3), object(5)
memory usage: 75.8+ KB